{
  "en": {
    "language_already_set": "You have already selected your language.",
    "cannot_use_own_referral": "You cannot use your own referral link.",
    "access_denied_incorrect_referral": "Access denied. Incorrect referral link.",
    "access_denied_no_referral": "Hello, stellar traveler! I am Fast, a leopard from the @finteh association, with unwavering enthusiasm and a love for the Cosmos blockchain.\nI am very glad that you are interested in my Telegram bot. We have created a project to launch rockets into orbit, where they begin to provide benefits! But you need to come here not just like that, but through someone. It can be a message in large Telegram groups or a personal invitation from a friend. Find them and come as you should! Good luck on your cosmic journey!",
    "language_set": "Your language has been set to English.",
    "your_referral_link": "Your referral link is: {ref_link}",
    "your_one_time_link": "Your one-time link is: {link}",
    "new_one_time_link": "Your new one-time website link: {link}",
    "dev_referral": "Hello, stellar traveler of the @{ref_arg} community!\nI am Fast, a leopard from the @finteh association, with unwavering enthusiasm and a love for the Cosmos blockchain. I have always been ready to help those who make this universe better. When the Posthuman team approached me for help, I couldn't refuse.",
    "user_referral": "Hello, stellar traveler @{name}!\nI am Fast, a leopard from the @finteh association, with unwavering enthusiasm and a love for the Cosmos blockchain. I am very glad that @{referrer_name} invited you! I have always been ready to help those who make this universe better. I hope you won't refuse to help the Posthuman team, just as I couldn't refuse.\n#interesting\nThe Posthuman team built a new rocket to launch into the Celestia galaxy - and it's not just any rocket. It's a high-tech machine that can ensure the security of transactions between different planets of the galaxy. But it had one problem - it didn't have enough Space Fuel to reach the orbit of active rockets, where it could receive rewards for its work.\nThe Posthuman team told me about their situation and asked if I could help them gather the necessary amount of space fuel called TIA. I knew it would be a challenging task, but I was ready to take it on.\n#interesting\nTo do this, I created a new efficient engine that will allow us to gather the required amount of TIA. We named this engine Raptor. With the help of Raptor, people from different corners of the Celestia galaxy could transfer their rights to use their space fuel TIA to us.\nAll that's needed now is to invite all the inhabitants of the Celestia galaxy and those who are willing to become them! Invite your friends using this invitation ticket, who have or can obtain some TIA for the launch of the Celestia rocket by the Posthuman team.\nIt's important to note that we didn't ask people to transfer the space fuel itself, but only the rights to use it - auth. The Posthuman team promised that their Celestia rocket would use these rights (redelegate) only when we collect the necessary amount of space fuel for the launch.\nThe first person who transferred their rights to use their Space Fuel to us was the Stellar Traveler. He transferred us the rights to use a small amount of Space Fuel, and I was so grateful to him that I decided to personally call him and thank him for his support.\nStellar Traveler, you didn't just transfer us the rights to use the Space Fuel, you invested in the future of Space. Your rights to use Space Fuel TIA became an important step towards successfully ensuring the security of transactions between the planets of the Celestia galaxy. We greatly appreciate your help and will always be grateful for your support."
  },
  "ru": {
    "language_already_set": "Вы уже выбрали язык.",
    "cannot_use_own_referral": "Вы не можете использовать свою собственную реферальную ссылку.",
    "access_denied_incorrect_referral": "Доступ запрещен. Неправильная реферальная ссылка.",
    "access_denied_no_referral": "Привет, звёздный путник! Я, Фаст, леопард из @finteh ассоциации, с неугасимым энтузиазмом и любовью к блокчейну Космос.\nЯ очень рад, что ты заинтересовался моим телеграм ботом. Мы создали проект для запуска ракет на орбиту, где они начинают приносить пользу! Но тебе нужно прийти сюда не просто так, а от кого-то. Это может быть сообщение в больших телеграм группах или персональное приглашение от друга. Найди их и приходи как должен! Удачи на твоём космическом пути!",
    "language_set": "Ваш язык установлен на русский.",
    "your_referral_link": "Ваша реферальная ссылка: {ref_link}",
    "your_one_time_link": "Ваша одноразовая ссылка: {link}",
    "new_one_time_link": "Ваша новая одноразовая ссылка на веб-сайт: {link}",
    "dev_referral": "Привет, звёздный путник сообщества @{ref_arg}!\nЯ, Фаст, леопард из @finteh ассоциации, с неугасимым энтузиазмом и любовью к блокчейну Космос. Я всегда был готов помочь тем, кто делает эту вселенную лучше. Когда ко мне обратилась команда Posthuman с просьбой о помощи, я не мог отказать.",
    "user_referral": "Привет, звёздный путник @{name}!\nЯ, Фаст, леопард из @finteh ассоциации, с неугасимым энтузиазмом и любовью к блокчейну Космос. Я очень рад, что @{referrer_name} позвал тебя! Я всегда был готов помочь тем, кто делает эту вселенную лучше. Надеюсь и ты тоже не откажешь в помощи команде Posthuman, как и я не смог отказать.\n#interesting\nКоманда Posthuman построили новую ракету для запуска в галактику Celestia - и это не просто любая ракета. Это высокотехнологичная машина, которая может обеспечить безопасность транзакций между различными планетами галактики. Но у нее была одна проблема - она не имела достаточно Космического горючего, чтобы достичь орбиты активных ракет, где она могла бы получать награды за свою работу.\nКоманда Posthuman рассказала мне о своей ситуации и спросила, могу ли я помочь им собрать необходимое количество космического горючего под названием TIA. Я знал, что это будет сложная задача, но я был готов взяться за неё.\n#interesting\nДля этого я создал новый производительный двигатель, который позволит собрать необходимое количество TIA. Мы назвали этот двигатель Raptor. С помощью Raptor люди из разных уголков галактики Celestia могли передать нам права на использование своего космического горючего TIA. \nВсё, что теперь нужно - это пригласить всех жителей галактики Celestia и тех, кто готов ими стать! Позови своих друзей с помощью этого пригласительного билета, у которых есть или они могут достать немного TIA для запуска ракеты Celestia от команды Posthuman.\nВажно отметить, что мы не просили людей передавать нам само космическое горючее, а лишь права на его использование - auth. Команда Posthuman обещали, что их ракета Celestia воспользуется этими правами (redelegate) только тогда, когда мы соберем необходимое количество космического горючего для запуска.\nПервый человек, который передал нам права на использование своего Космического горючего, был Звездный Путник. Он передал нам права на использование небольшого количества Космического горючего, и я был так благодарен ему, что решил лично позвонить ему и поблагодарить за его поддержку.\nЗвездный Путник, вы не просто передали нам права на использование Космического горючего, вы инвестировали в будущее Космос. Ваши права на использование Космического горючего TIA стали важным шагом на пути к успеху обеспечения безопасности транзакций между планетами галактики Celestia. Мы очень ценим вашу помощь и будем всегда благодарны вам за поддержку."
  }
}
